OpenQBMM-OpenFOAM-v2306/validation/oneWayCoupledVdfTransportFoam/sizeTaylorGreen/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

nPts 100;

vertices
(
    (   -0.5 -0.5   -0.1)   //0
    (   0.5  -0.5   -0.1)   //1
    (   0.5  0.5    -0.1)   //2
    (   -0.5 0.5    -0.1)   //3
    (   -0.5 -0.5   0.1 )   //4
    (   0.5  -0.5   0.1 )   //5
    (   0.5  0.5    0.1 )   //6
    (   -0.5 0.5    0.1 )   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nPts $nPts 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type            cyclic;
        neighbourPatch  bottom;
        faces
        (
            (3 2 6 7)
        );
    }
    bottom
    {
        type            cyclic;
        neighbourPatch  top;
        faces
        (
            (0 1 5 4)
        );
    }
    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces
        (
            (0 3 7 4)
        );
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces
        (
            (1 2 6 5)
        );
    }
    front
    {
        type            empty;
        faces
        (
            (0 1 2 3)
        );
    }
    back
    {
        type            empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //)))))
